; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 263052 1 3 3 4 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	image0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 image0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Star4 image0)
	(have_image Star5 thermograph1)
	(have_image Planet6 infrared2)
	(have_image Star7 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 star7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
4. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
5. (take_image satellite0 star5 instrument0 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 2 of 5
6. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 5
7. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 5
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 5
9. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 5
10. (turn_to satellite0 planet6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet6)
   goals met: 1 of 5
11. (take_image satellite0 planet6 instrument2 infrared2)
   added: (have_image planet6 infrared2)
   goals met: 2 of 5
12. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   goals met: 2 of 5
13. (take_image satellite0 star7 instrument2 image0)
   added: (have_image star7 image0)
   goals met: 3 of 5
14. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 4 of 5
15. (turn_to satellite0 star4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star4)
   goals met: 3 of 5
16. (take_image satellite0 star4 instrument2 image0)
   added: (have_image star4 image0)
   goals met: 4 of 5
17. (turn_to satellite0 star5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star5)
   goals met: 5 of 5
